app/views/users/edit.html.erb

SELECT "cities".* FROM "cities"
---

              <%= f.select :city_id, options_from_collection_for_select(City.all, "id", "name") %>