app/controllers/cities_controller.rb

  def show
  	@city = City.friendly.find(params[:name])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT 1  [["id", 0]]