app/controllers/messages_controller.rb

	def show
		@message = Message.find(params[:id])
		@user = User.find_by({:email => @message.to})
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "daimeon@email.com"]]

	def create
		@message = Message.new(message_params)
			@message.from = current_user.email

		if @message.save
			current_user.messages << @message
			reciever = User.find_by_email(@message.to)
---
INSERT INTO "messages" ("to", "title", "body", "from", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["to", "daimeon@email.com"], ["title", "hi"], ["body", "hi"], ["from", ""], ["created_at", "2015-09-09 17:23:02.024060"], ["updated_at", "2015-09-09 17:23:02.024060"]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "daimeon@email.com"]]